analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/spixfc_regs.h
#define MXC_F_SPIXFC_CTRL0_PGSZ_POS                    6 /**< CTRL0_PGSZ Position */
#define MXC_F_SPIXFC_CTRL0_PGSZ                        ((uint32_t)(0x3UL << MXC_F_SPIXFC_CTRL0_PGSZ_POS)) /**< CTRL0_PGSZ Mask */
#define MXC_V_SPIXFC_CTRL0_PGSZ_4_BYTES                ((uint32_t)0x0UL) /**< CTRL0_PGSZ_4_BYTES Value */
#define MXC_S_SPIXFC_CTRL0_PGSZ_4_BYTES                (MXC_V_SPIXFC_CTRL0_PGSZ_4_BYTES << MXC_F_SPIXFC_CTRL0_PGSZ_POS) /**< CTRL0_PGSZ_4_BYTES Setting */
#define MXC_V_SPIXFC_CTRL0_PGSZ_8_BYTES                ((uint32_t)0x1UL) /**< CTRL0_PGSZ_8_BYTES Value */
#define MXC_S_SPIXFC_CTRL0_PGSZ_8_BYTES                (MXC_V_SPIXFC_CTRL0_PGSZ_8_BYTES << MXC_F_SPIXFC_CTRL0_PGSZ_POS) /**< CTRL0_PGSZ_8_BYTES Setting */
#define MXC_V_SPIXFC_CTRL0_PGSZ_16_BYTES               ((uint32_t)0x2UL) /**< CTRL0_PGSZ_16_BYTES Value */
#define MXC_S_SPIXFC_CTRL0_PGSZ_16_BYTES               (MXC_V_SPIXFC_CTRL0_PGSZ_16_BYTES << MXC_F_SPIXFC_CTRL0_PGSZ_POS) /**< CTRL0_PGSZ_16_BYTES Setting */
#define MXC_V_SPIXFC_CTRL0_PGSZ_32_BYTES               ((uint32_t)0x3UL) /**< CTRL0_PGSZ_32_BYTES Value */
#define MXC_S_SPIXFC_CTRL0_PGSZ_32_BYTES               (MXC_V_SPIXFC_CTRL0_PGSZ_32_BYTES << MXC_F_SPIXFC_CTRL0_PGSZ_POS) /**< CTRL0_PGSZ_32_BYTES Setting */

#define MXC_F_SPIXFC_CTRL0_HICLK_POS                   8 /**< CTRL0_HICLK Position */
#define MXC_F_SPIXFC_CTRL0_HICLK                       ((uint32_t)(0xFUL << MXC_F_SPIXFC_CTRL0_HICLK_POS)) /**< CTRL0_HICLK Mask */
#define MXC_V_SPIXFC_CTRL0_HICLK_16_SCLK               ((uint32_t)0x0UL) /**< CTRL0_HICLK_16_SCLK Value */
#define MXC_S_SPIXFC_CTRL0_HICLK_16_SCLK               (MXC_V_SPIXFC_CTRL0_HICLK_16_SCLK << MXC_F_SPIXFC_CTRL0_HICLK_POS) /**< CTRL0_HICLK_16_SCLK Setting */

#define MXC_F_SPIXFC_CTRL0_LOCLK_POS                   12 /**< CTRL0_LOCLK Position */
#define MXC_F_SPIXFC_CTRL0_LOCLK                       ((uint32_t)(0xFUL << MXC_F_SPIXFC_CTRL0_LOCLK_POS)) /**< CTRL0_LOCLK Mask */
#define MXC_V_SPIXFC_CTRL0_LOCLK_16_SCLK               ((uint32_t)0x0UL) /**< CTRL0_LOCLK_16_SCLK Value */
#define MXC_S_SPIXFC_CTRL0_LOCLK_16_SCLK               (MXC_V_SPIXFC_CTRL0_LOCLK_16_SCLK << MXC_F_SPIXFC_CTRL0_LOCLK_POS) /**< CTRL0_LOCLK_16_SCLK Setting */

#define MXC_F_SPIXFC_CTRL0_SSACT_POS                   16 /**< CTRL0_SSACT Position */
#define MXC_F_SPIXFC_CTRL0_SSACT                       ((uint32_t)(0x3UL << MXC_F_SPIXFC_CTRL0_SSACT_POS)) /**< CTRL0_SSACT Mask */
#define MXC_V_SPIXFC_CTRL0_SSACT_0_CLKS                ((uint32_t)0x0UL) /**< CTRL0_SSACT_0_CLKS Value */
#define MXC_S_SPIXFC_CTRL0_SSACT_0_CLKS                (MXC_V_SPIXFC_CTRL0_SSACT_0_CLKS << MXC_F_SPIXFC_CTRL0_SSACT_POS) /**< CTRL0_SSACT_0_CLKS Setting */
#define MXC_V_SPIXFC_CTRL0_SSACT_2_CLKS                ((uint32_t)0x1UL) /**< CTRL0_SSACT_2_CLKS Value */
#define MXC_S_SPIXFC_CTRL0_SSACT_2_CLKS                (MXC_V_SPIXFC_CTRL0_SSACT_2_CLKS << MXC_F_SPIXFC_CTRL0_SSACT_POS) /**< CTRL0_SSACT_2_CLKS Setting */
#define MXC_V_SPIXFC_CTRL0_SSACT_4_CLKS                ((uint32_t)0x2UL) /**< CTRL0_SSACT_4_CLKS Value */
#define MXC_S_SPIXFC_CTRL0_SSACT_4_CLKS                (MXC_V_SPIXFC_CTRL0_SSACT_4_CLKS << MXC_F_SPIXFC_CTRL0_SSACT_POS) /**< CTRL0_SSACT_4_CLKS Setting */
#define MXC_V_SPIXFC_CTRL0_SSACT_8_CLKS                ((uint32_t)0x3UL) /**< CTRL0_SSACT_8_CLKS Value */
#define MXC_S_SPIXFC_CTRL0_SSACT_8_CLKS                (MXC_V_SPIXFC_CTRL0_SSACT_8_CLKS << MXC_F_SPIXFC_CTRL0_SSACT_POS) /**< CTRL0_SSACT_8_CLKS Setting */

#define MXC_F_SPIXFC_CTRL0_SSIACT_POS                  18 /**< CTRL0_SSIACT Position */
#define MXC_F_SPIXFC_CTRL0_SSIACT                      ((uint32_t)(0x3UL << MXC_F_SPIXFC_CTRL0_SSIACT_POS)) /**< CTRL0_SSIACT Mask */
#define MXC_V_SPIXFC_CTRL0_SSIACT_4_CLKS               ((uint32_t)0x0UL) /**< CTRL0_SSIACT_4_CLKS Value */
#define MXC_S_SPIXFC_CTRL0_SSIACT_4_CLKS               (MXC_V_SPIXFC_CTRL0_SSIACT_4_CLKS << MXC_F_SPIXFC_CTRL0_SSIACT_POS) /**< CTRL0_SSIACT_4_CLKS Setting */
#define MXC_V_SPIXFC_CTRL0_SSIACT_6_CLKS               ((uint32_t)0x1UL) /**< CTRL0_SSIACT_6_CLKS Value */
#define MXC_S_SPIXFC_CTRL0_SSIACT_6_CLKS               (MXC_V_SPIXFC_CTRL0_SSIACT_6_CLKS << MXC_F_SPIXFC_CTRL0_SSIACT_POS) /**< CTRL0_SSIACT_6_CLKS Setting */
#define MXC_V_SPIXFC_CTRL0_SSIACT_8_CLKS               ((uint32_t)0x2UL) /**< CTRL0_SSIACT_8_CLKS Value */
#define MXC_S_SPIXFC_CTRL0_SSIACT_8_CLKS               (MXC_V_SPIXFC_CTRL0_SSIACT_8_CLKS << MXC_F_SPIXFC_CTRL0_SSIACT_POS) /**< CTRL0_SSIACT_8_CLKS Setting */
#define MXC_V_SPIXFC_CTRL0_SSIACT_12_CLKS              ((uint32_t)0x3UL) /**< CTRL0_SSIACT_12_CLKS Value */
#define MXC_S_SPIXFC_CTRL0_SSIACT_12_CLKS              (MXC_V_SPIXFC_CTRL0_SSIACT_12_CLKS << MXC_F_SPIXFC_CTRL0_SSIACT_POS) /**< CTRL0_SSIACT_12_CLKS Setting */

#define MXC_F_SPIXFC_CTRL0_IOSMPL_POS                  20 /**< CTRL0_IOSMPL Position */
#define MXC_F_SPIXFC_CTRL0_IOSMPL                      ((uint32_t)(0xFUL << MXC_F_SPIXFC_CTRL0_IOSMPL_POS)) /**< CTRL0_IOSMPL Mask */

/**@} end of group SPIXFC_CTRL0_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_SSPOL SPIXFC_SSPOL
 * @brief    SPIX Controller Slave Select Polarity Register.
 * @{
 */
#define MXC_F_SPIXFC_SSPOL_SS_POL_POS                  0 /**< SSPOL_SS_POL Position */
#define MXC_F_SPIXFC_SSPOL_SS_POL                      ((uint32_t)(0x1UL << MXC_F_SPIXFC_SSPOL_SS_POL_POS)) /**< SSPOL_SS_POL Mask */

#define MXC_F_SPIXFC_SSPOL_FC_POL_POS                  8 /**< SSPOL_FC_POL Position */
#define MXC_F_SPIXFC_SSPOL_FC_POL                      ((uint32_t)(0x1UL << MXC_F_SPIXFC_SSPOL_FC_POL_POS)) /**< SSPOL_FC_POL Mask */

/**@} end of group SPIXFC_SSPOL_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_CTRL1 SPIXFC_CTRL1
 * @brief    SPIX Controller General Controller Register.
 * @{
 */
#define MXC_F_SPIXFC_CTRL1_EN_POS                      0 /**< CTRL1_EN Position */
#define MXC_F_SPIXFC_CTRL1_EN                          ((uint32_t)(0x1UL << MXC_F_SPIXFC_CTRL1_EN_POS)) /**< CTRL1_EN Mask */

#define MXC_F_SPIXFC_CTRL1_TX_FIFO_EN_POS              1 /**< CTRL1_TX_FIFO_EN Position */
#define MXC_F_SPIXFC_CTRL1_TX_FIFO_EN                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_CTRL1_TX_FIFO_EN_POS)) /**< CTRL1_TX_FIFO_EN Mask */

#define MXC_F_SPIXFC_CTRL1_RX_FIFO_EN_POS              2 /**< CTRL1_RX_FIFO_EN Position */
#define MXC_F_SPIXFC_CTRL1_RX_FIFO_EN                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_CTRL1_RX_FIFO_EN_POS)) /**< CTRL1_RX_FIFO_EN Mask */

#define MXC_F_SPIXFC_CTRL1_BBMODE_POS                  3 /**< CTRL1_BBMODE Position */
#define MXC_F_SPIXFC_CTRL1_BBMODE                      ((uint32_t)(0x1UL << MXC_F_SPIXFC_CTRL1_BBMODE_POS)) /**< CTRL1_BBMODE Mask */

#define MXC_F_SPIXFC_CTRL1_SSDR_POS                    4 /**< CTRL1_SSDR Position */
#define MXC_F_SPIXFC_CTRL1_SSDR                        ((uint32_t)(0x1UL << MXC_F_SPIXFC_CTRL1_SSDR_POS)) /**< CTRL1_SSDR Mask */

#define MXC_F_SPIXFC_CTRL1_FCDR_POS                    5 /**< CTRL1_FCDR Position */
#define MXC_F_SPIXFC_CTRL1_FCDR                        ((uint32_t)(0x1UL << MXC_F_SPIXFC_CTRL1_FCDR_POS)) /**< CTRL1_FCDR Mask */

#define MXC_F_SPIXFC_CTRL1_SCLKDR_POS                  6 /**< CTRL1_SCLKDR Position */
#define MXC_F_SPIXFC_CTRL1_SCLKDR                      ((uint32_t)(0x1UL << MXC_F_SPIXFC_CTRL1_SCLKDR_POS)) /**< CTRL1_SCLKDR Mask */

#define MXC_F_SPIXFC_CTRL1_SDIO_DATA_IN_POS            8 /**< CTRL1_SDIO_DATA_IN Position */
#define MXC_F_SPIXFC_CTRL1_SDIO_DATA_IN                ((uint32_t)(0xFUL << MXC_F_SPIXFC_CTRL1_SDIO_DATA_IN_POS)) /**< CTRL1_SDIO_DATA_IN Mask */
#define MXC_V_SPIXFC_CTRL1_SDIO_DATA_IN_SDIO0          ((uint32_t)0x0UL) /**< CTRL1_SDIO_DATA_IN_SDIO0 Value */
#define MXC_S_SPIXFC_CTRL1_SDIO_DATA_IN_SDIO0          (MXC_V_SPIXFC_CTRL1_SDIO_DATA_IN_SDIO0 << MXC_F_SPIXFC_CTRL1_SDIO_DATA_IN_POS) /**< CTRL1_SDIO_DATA_IN_SDIO0 Setting */
#define MXC_V_SPIXFC_CTRL1_SDIO_DATA_IN_SDIO1          ((uint32_t)0x1UL) /**< CTRL1_SDIO_DATA_IN_SDIO1 Value */
#define MXC_S_SPIXFC_CTRL1_SDIO_DATA_IN_SDIO1          (MXC_V_SPIXFC_CTRL1_SDIO_DATA_IN_SDIO1 << MXC_F_SPIXFC_CTRL1_SDIO_DATA_IN_POS) /**< CTRL1_SDIO_DATA_IN_SDIO1 Setting */
#define MXC_V_SPIXFC_CTRL1_SDIO_DATA_IN_SDIO2          ((uint32_t)0x2UL) /**< CTRL1_SDIO_DATA_IN_SDIO2 Value */
#define MXC_S_SPIXFC_CTRL1_SDIO_DATA_IN_SDIO2          (MXC_V_SPIXFC_CTRL1_SDIO_DATA_IN_SDIO2 << MXC_F_SPIXFC_CTRL1_SDIO_DATA_IN_POS) /**< CTRL1_SDIO_DATA_IN_SDIO2 Setting */
#define MXC_V_SPIXFC_CTRL1_SDIO_DATA_IN_SDIO3          ((uint32_t)0x3UL) /**< CTRL1_SDIO_DATA_IN_SDIO3 Value */
#define MXC_S_SPIXFC_CTRL1_SDIO_DATA_IN_SDIO3          (MXC_V_SPIXFC_CTRL1_SDIO_DATA_IN_SDIO3 << MXC_F_SPIXFC_CTRL1_SDIO_DATA_IN_POS) /**< CTRL1_SDIO_DATA_IN_SDIO3 Setting */

#define MXC_F_SPIXFC_CTRL1_BB_DATA_OUT_POS             12 /**< CTRL1_BB_DATA_OUT Position */
#define MXC_F_SPIXFC_CTRL1_BB_DATA_OUT                 ((uint32_t)(0xFUL << MXC_F_SPIXFC_CTRL1_BB_DATA_OUT_POS)) /**< CTRL1_BB_DATA_OUT Mask */
#define MXC_V_SPIXFC_CTRL1_BB_DATA_OUT_SDIO0           ((uint32_t)0x0UL) /**< CTRL1_BB_DATA_OUT_SDIO0 Value */
#define MXC_S_SPIXFC_CTRL1_BB_DATA_OUT_SDIO0           (MXC_V_SPIXFC_CTRL1_BB_DATA_OUT_SDIO0 << MXC_F_SPIXFC_CTRL1_BB_DATA_OUT_POS) /**< CTRL1_BB_DATA_OUT_SDIO0 Setting */
#define MXC_V_SPIXFC_CTRL1_BB_DATA_OUT_SDIO1           ((uint32_t)0x1UL) /**< CTRL1_BB_DATA_OUT_SDIO1 Value */
#define MXC_S_SPIXFC_CTRL1_BB_DATA_OUT_SDIO1           (MXC_V_SPIXFC_CTRL1_BB_DATA_OUT_SDIO1 << MXC_F_SPIXFC_CTRL1_BB_DATA_OUT_POS) /**< CTRL1_BB_DATA_OUT_SDIO1 Setting */
#define MXC_V_SPIXFC_CTRL1_BB_DATA_OUT_SDIO2           ((uint32_t)0x2UL) /**< CTRL1_BB_DATA_OUT_SDIO2 Value */
#define MXC_S_SPIXFC_CTRL1_BB_DATA_OUT_SDIO2           (MXC_V_SPIXFC_CTRL1_BB_DATA_OUT_SDIO2 << MXC_F_SPIXFC_CTRL1_BB_DATA_OUT_POS) /**< CTRL1_BB_DATA_OUT_SDIO2 Setting */
#define MXC_V_SPIXFC_CTRL1_BB_DATA_OUT_SDIO3           ((uint32_t)0x3UL) /**< CTRL1_BB_DATA_OUT_SDIO3 Value */
#define MXC_S_SPIXFC_CTRL1_BB_DATA_OUT_SDIO3           (MXC_V_SPIXFC_CTRL1_BB_DATA_OUT_SDIO3 << MXC_F_SPIXFC_CTRL1_BB_DATA_OUT_POS) /**< CTRL1_BB_DATA_OUT_SDIO3 Setting */

#define MXC_F_SPIXFC_CTRL1_BB_DATA_OUT_EN_POS          16 /**< CTRL1_BB_DATA_OUT_EN Position */
#define MXC_F_SPIXFC_CTRL1_BB_DATA_OUT_EN              ((uint32_t)(0xFUL << MXC_F_SPIXFC_CTRL1_BB_DATA_OUT_EN_POS)) /**< CTRL1_BB_DATA_OUT_EN Mask */
#define MXC_V_SPIXFC_CTRL1_BB_DATA_OUT_EN_SDIO0        ((uint32_t)0x0UL) /**< CTRL1_BB_DATA_OUT_EN_SDIO0 Value */
#define MXC_S_SPIXFC_CTRL1_BB_DATA_OUT_EN_SDIO0        (MXC_V_SPIXFC_CTRL1_BB_DATA_OUT_EN_SDIO0 << MXC_F_SPIXFC_CTRL1_BB_DATA_OUT_EN_POS) /**< CTRL1_BB_DATA_OUT_EN_SDIO0 Setting */
#define MXC_V_SPIXFC_CTRL1_BB_DATA_OUT_EN_SDIO1        ((uint32_t)0x1UL) /**< CTRL1_BB_DATA_OUT_EN_SDIO1 Value */
#define MXC_S_SPIXFC_CTRL1_BB_DATA_OUT_EN_SDIO1        (MXC_V_SPIXFC_CTRL1_BB_DATA_OUT_EN_SDIO1 << MXC_F_SPIXFC_CTRL1_BB_DATA_OUT_EN_POS) /**< CTRL1_BB_DATA_OUT_EN_SDIO1 Setting */
#define MXC_V_SPIXFC_CTRL1_BB_DATA_OUT_EN_SDIO2        ((uint32_t)0x2UL) /**< CTRL1_BB_DATA_OUT_EN_SDIO2 Value */
#define MXC_S_SPIXFC_CTRL1_BB_DATA_OUT_EN_SDIO2        (MXC_V_SPIXFC_CTRL1_BB_DATA_OUT_EN_SDIO2 << MXC_F_SPIXFC_CTRL1_BB_DATA_OUT_EN_POS) /**< CTRL1_BB_DATA_OUT_EN_SDIO2 Setting */
#define MXC_V_SPIXFC_CTRL1_BB_DATA_OUT_EN_SDIO3        ((uint32_t)0x3UL) /**< CTRL1_BB_DATA_OUT_EN_SDIO3 Value */
#define MXC_S_SPIXFC_CTRL1_BB_DATA_OUT_EN_SDIO3        (MXC_V_SPIXFC_CTRL1_BB_DATA_OUT_EN_SDIO3 << MXC_F_SPIXFC_CTRL1_BB_DATA_OUT_EN_POS) /**< CTRL1_BB_DATA_OUT_EN_SDIO3 Setting */

#define MXC_F_SPIXFC_CTRL1_SIMPLE_POS                  20 /**< CTRL1_SIMPLE Position */
#define MXC_F_SPIXFC_CTRL1_SIMPLE                      ((uint32_t)(0x1UL << MXC_F_SPIXFC_CTRL1_SIMPLE_POS)) /**< CTRL1_SIMPLE Mask */

#define MXC_F_SPIXFC_CTRL1_SIMPLE_RX_POS               21 /**< CTRL1_SIMPLE_RX Position */
#define MXC_F_SPIXFC_CTRL1_SIMPLE_RX                   ((uint32_t)(0x1UL << MXC_F_SPIXFC_CTRL1_SIMPLE_RX_POS)) /**< CTRL1_SIMPLE_RX Mask */

#define MXC_F_SPIXFC_CTRL1_SIMPLE_SS_POS               22 /**< CTRL1_SIMPLE_SS Position */
#define MXC_F_SPIXFC_CTRL1_SIMPLE_SS                   ((uint32_t)(0x1UL << MXC_F_SPIXFC_CTRL1_SIMPLE_SS_POS)) /**< CTRL1_SIMPLE_SS Mask */

#define MXC_F_SPIXFC_CTRL1_SCLK_FB_POS                 24 /**< CTRL1_SCLK_FB Position */
#define MXC_F_SPIXFC_CTRL1_SCLK_FB                     ((uint32_t)(0x1UL << MXC_F_SPIXFC_CTRL1_SCLK_FB_POS)) /**< CTRL1_SCLK_FB Mask */

#define MXC_F_SPIXFC_CTRL1_SCLK_FB_INV_POS             25 /**< CTRL1_SCLK_FB_INV Position */
#define MXC_F_SPIXFC_CTRL1_SCLK_FB_INV                 ((uint32_t)(0x1UL << MXC_F_SPIXFC_CTRL1_SCLK_FB_INV_POS)) /**< CTRL1_SCLK_FB_INV Mask */

