analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/spixfc_regs.h
/**@} end of group SPIXFC_CTRL1_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_CTRL2 SPIXFC_CTRL2
 * @brief    SPIX Controller FIFO Control and Status Register.
 * @{
 */
#define MXC_F_SPIXFC_CTRL2_TX_AE_LVL_POS               0 /**< CTRL2_TX_AE_LVL Position */
#define MXC_F_SPIXFC_CTRL2_TX_AE_LVL                   ((uint32_t)(0xFUL << MXC_F_SPIXFC_CTRL2_TX_AE_LVL_POS)) /**< CTRL2_TX_AE_LVL Mask */

#define MXC_F_SPIXFC_CTRL2_TX_CNT_POS                  8 /**< CTRL2_TX_CNT Position */
#define MXC_F_SPIXFC_CTRL2_TX_CNT                      ((uint32_t)(0x1FUL << MXC_F_SPIXFC_CTRL2_TX_CNT_POS)) /**< CTRL2_TX_CNT Mask */

#define MXC_F_SPIXFC_CTRL2_RX_AF_LVL_POS               16 /**< CTRL2_RX_AF_LVL Position */
#define MXC_F_SPIXFC_CTRL2_RX_AF_LVL                   ((uint32_t)(0x1FUL << MXC_F_SPIXFC_CTRL2_RX_AF_LVL_POS)) /**< CTRL2_RX_AF_LVL Mask */

#define MXC_F_SPIXFC_CTRL2_RX_CNT_POS                  24 /**< CTRL2_RX_CNT Position */
#define MXC_F_SPIXFC_CTRL2_RX_CNT                      ((uint32_t)(0x3FUL << MXC_F_SPIXFC_CTRL2_RX_CNT_POS)) /**< CTRL2_RX_CNT Mask */

/**@} end of group SPIXFC_CTRL2_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_CTRL3 SPIXFC_CTRL3
 * @brief    SPIX Controller Special Control Register.
 * @{
 */
#define MXC_F_SPIXFC_CTRL3_SAMPLE_POS                  0 /**< CTRL3_SAMPLE Position */
#define MXC_F_SPIXFC_CTRL3_SAMPLE                      ((uint32_t)(0x1UL << MXC_F_SPIXFC_CTRL3_SAMPLE_POS)) /**< CTRL3_SAMPLE Mask */

#define MXC_F_SPIXFC_CTRL3_MISO_FC_EN_POS              1 /**< CTRL3_MISO_FC_EN Position */
#define MXC_F_SPIXFC_CTRL3_MISO_FC_EN                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_CTRL3_MISO_FC_EN_POS)) /**< CTRL3_MISO_FC_EN Mask */

#define MXC_F_SPIXFC_CTRL3_SDIO_OUT_POS                4 /**< CTRL3_SDIO_OUT Position */
#define MXC_F_SPIXFC_CTRL3_SDIO_OUT                    ((uint32_t)(0xFUL << MXC_F_SPIXFC_CTRL3_SDIO_OUT_POS)) /**< CTRL3_SDIO_OUT Mask */

#define MXC_F_SPIXFC_CTRL3_SDIO_OUT_EN_POS             8 /**< CTRL3_SDIO_OUT_EN Position */
#define MXC_F_SPIXFC_CTRL3_SDIO_OUT_EN                 ((uint32_t)(0xFUL << MXC_F_SPIXFC_CTRL3_SDIO_OUT_EN_POS)) /**< CTRL3_SDIO_OUT_EN Mask */

#define MXC_F_SPIXFC_CTRL3_SCLKINH3_POS                16 /**< CTRL3_SCLKINH3 Position */
#define MXC_F_SPIXFC_CTRL3_SCLKINH3                    ((uint32_t)(0x1UL << MXC_F_SPIXFC_CTRL3_SCLKINH3_POS)) /**< CTRL3_SCLKINH3 Mask */

/**@} end of group SPIXFC_CTRL3_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_INTFL SPIXFC_INTFL
 * @brief    SPIX Controller Interrupt Status Register.
 * @{
 */
#define MXC_F_SPIXFC_INTFL_TX_STALLED_POS              0 /**< INTFL_TX_STALLED Position */
#define MXC_F_SPIXFC_INTFL_TX_STALLED                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_INTFL_TX_STALLED_POS)) /**< INTFL_TX_STALLED Mask */

#define MXC_F_SPIXFC_INTFL_RX_STALLED_POS              1 /**< INTFL_RX_STALLED Position */
#define MXC_F_SPIXFC_INTFL_RX_STALLED                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_INTFL_RX_STALLED_POS)) /**< INTFL_RX_STALLED Mask */

#define MXC_F_SPIXFC_INTFL_TX_RDY_POS                  2 /**< INTFL_TX_RDY Position */
#define MXC_F_SPIXFC_INTFL_TX_RDY                      ((uint32_t)(0x1UL << MXC_F_SPIXFC_INTFL_TX_RDY_POS)) /**< INTFL_TX_RDY Mask */

#define MXC_F_SPIXFC_INTFL_RX_DONE_POS                 3 /**< INTFL_RX_DONE Position */
#define MXC_F_SPIXFC_INTFL_RX_DONE                     ((uint32_t)(0x1UL << MXC_F_SPIXFC_INTFL_RX_DONE_POS)) /**< INTFL_RX_DONE Mask */

#define MXC_F_SPIXFC_INTFL_TX_FIFO_AE_POS              4 /**< INTFL_TX_FIFO_AE Position */
#define MXC_F_SPIXFC_INTFL_TX_FIFO_AE                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_INTFL_TX_FIFO_AE_POS)) /**< INTFL_TX_FIFO_AE Mask */

#define MXC_F_SPIXFC_INTFL_RX_FIFO_AF_POS              5 /**< INTFL_RX_FIFO_AF Position */
#define MXC_F_SPIXFC_INTFL_RX_FIFO_AF                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_INTFL_RX_FIFO_AF_POS)) /**< INTFL_RX_FIFO_AF Mask */

/**@} end of group SPIXFC_INTFL_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_INTEN SPIXFC_INTEN
 * @brief    SPIX Controller Interrupt Enable Register.
 * @{
 */
#define MXC_F_SPIXFC_INTEN_TX_STALLED_POS              0 /**< INTEN_TX_STALLED Position */
#define MXC_F_SPIXFC_INTEN_TX_STALLED                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_INTEN_TX_STALLED_POS)) /**< INTEN_TX_STALLED Mask */

#define MXC_F_SPIXFC_INTEN_RX_STALLED_POS              1 /**< INTEN_RX_STALLED Position */
#define MXC_F_SPIXFC_INTEN_RX_STALLED                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_INTEN_RX_STALLED_POS)) /**< INTEN_RX_STALLED Mask */

#define MXC_F_SPIXFC_INTEN_TX_RDY_POS                  2 /**< INTEN_TX_RDY Position */
#define MXC_F_SPIXFC_INTEN_TX_RDY                      ((uint32_t)(0x1UL << MXC_F_SPIXFC_INTEN_TX_RDY_POS)) /**< INTEN_TX_RDY Mask */

#define MXC_F_SPIXFC_INTEN_RX_DONE_POS                 3 /**< INTEN_RX_DONE Position */
#define MXC_F_SPIXFC_INTEN_RX_DONE                     ((uint32_t)(0x1UL << MXC_F_SPIXFC_INTEN_RX_DONE_POS)) /**< INTEN_RX_DONE Mask */

#define MXC_F_SPIXFC_INTEN_TX_FIFO_AE_POS              4 /**< INTEN_TX_FIFO_AE Position */
#define MXC_F_SPIXFC_INTEN_TX_FIFO_AE                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_INTEN_TX_FIFO_AE_POS)) /**< INTEN_TX_FIFO_AE Mask */

#define MXC_F_SPIXFC_INTEN_RX_FIFO_AF_POS              5 /**< INTEN_RX_FIFO_AF Position */
#define MXC_F_SPIXFC_INTEN_RX_FIFO_AF                  ((uint32_t)(0x1UL << MXC_F_SPIXFC_INTEN_RX_FIFO_AF_POS)) /**< INTEN_RX_FIFO_AF Mask */

/**@} end of group SPIXFC_INTEN_Register */

/**
 * @ingroup  spixfc_registers
 * @defgroup SPIXFC_SIMPLE_HEADER SPIXFC_SIMPLE_HEADER
 * @brief    Simple Header
 * @{
 */
#define MXC_F_SPIXFC_SIMPLE_HEADER_TX_BIDIR_POS        0 /**< SIMPLE_HEADER_TX_BIDIR Position */
#define MXC_F_SPIXFC_SIMPLE_HEADER_TX_BIDIR            ((uint32_t)(0x3FFFUL << MXC_F_SPIXFC_SIMPLE_HEADER_TX_BIDIR_POS)) /**< SIMPLE_HEADER_TX_BIDIR Mask */

#define MXC_F_SPIXFC_SIMPLE_HEADER_RX_ONLY_POS         16 /**< SIMPLE_HEADER_RX_ONLY Position */
#define MXC_F_SPIXFC_SIMPLE_HEADER_RX_ONLY             ((uint32_t)(0x3FFFUL << MXC_F_SPIXFC_SIMPLE_HEADER_RX_ONLY_POS)) /**< SIMPLE_HEADER_RX_ONLY Mask */

/**@} end of group SPIXFC_SIMPLE_HEADER_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32690_INCLUDE_SPIXFC_REGS_H_
